import React from 'react'
import { Jumbotron } from '../common/jumbotron/Jumbotron';
import SectionWithBg from '../common/SectionWithBg/SectionWithBg';
import { Row, Col } from 'react-bootstrap';
import {Title} from '../common/Title/Title';
import { TextWithArrow } from '../common/TextWithArrow/TextWithArrow';


export const Polices = (props) => (
  <div>
    <Jumbotron jumboClass='page-slide' massegeClass='hideClass' massege='الشروط والسياسات'/>
    <SectionWithBg ImageClass='whiteSection' >
      <div className='polices-content'>
        <Title titleType='sub-title' title='الشروط والواجبات' border='title-no-border'/>
        <Row>
          <Col xs={12} >
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
          </Col>
          <Col />

        </Row>
      </div>
      <div className='polices-content'>
        <Title titleType='sub-title' title='سياسة الخصوصية' border='title-no-border'/>
        <Row>
          <Col xs={12} >
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
            <TextWithArrow text=' على أتم استعداد من المواد المتاحة من أجل تحقيق كل ما يهم الناس التي تقوم على خدمة هذهالمنصة وهذا المنتج الذي يكون على أتم استعداد الأهم في هذه المادة الإعلامية اتاحة نشر وتسوق الخطط التدريبية ومواعيد الدورات المزمع انعقادها. '/>
          </Col>
          <Col />

        </Row>
      </div>
    </SectionWithBg>
  </div>
)
